import math
import random
# Найти длину окружности с определённым радиусом
# r = 100
# print(2*r*math.pi)

# Найти площадь окружности с определённым радиусом
# r = 100
# print((r**2)*math.pi)
# print((math.pow(r, 2)*math.pi))

# По уоординатам 2-х точек определить расстояние между ними
# x1=10
# y1=10
# x2=50
# y2=100
# l= math.sqrt((x1-x2)**2+(y1-y2)**2)
# print(l)

# Найти факторитал числа 9
# print(math.factorial(9))

from random import randint, choice, sample, shuffle
# Выбрать людое число
# play = ['1','2','5','8']
# print(choice(play))

# Выбрать 3-х победителей лотереи из списка play
# play = ['1','2','5','8','6']
# print(sample(play, 3))

# Перемешать числа
# my_list = [random.randint(1,10) for _ in range(10)]
# print(my_list)
# shuffle(my_list)
# print(my_list)